'''Фирма ежегодно на протяжении n лет закупала оборудование стоимостью соответственно s1, s2, ..., sn pублей в год
(эти числа вводятся и обрабатываются последовательно). Ежегодно в результате износа и морального старения (амортизации)
 все имеющееся оборудование уценивается на р%. Какова общая стоимость накопленного оборудования за n лет?'''

from random import *

cost_later = 0
p = randrange(1, 99)
cost = [(randrange(1, 1000)) for i in range(randrange(3, 10))]
print('Ежегодные закупки оборудования:', *['{0:2.2f}$'.format(j) for j in cost], sep='\n')
print(f'Амортизация: {p}%')
for i in cost:
    cost_later += i
    cost_later *= p / 100
print(f'Остаточная стоймость :', '{0:2.2f}$'.format(cost_later))
